In [4]:
import pandas as pd 
import numpy as np 
import matplotlib as plt 
import seaborn as sns
%matplotlib inline

In [6]:
data1= pd.read_csv('Chapters.csv')
data2=pd.read_csv('Characters.csv')

In [8]:
data1.head()

,Chapter_Number,Volume,Name,Romanized_title,Viz_title,Pages,Date,Episodes
0,1,1,Romance Dawn - The Dawn of the Adventure,Romansu Don - Boken no Yoake,Romance Dawn,53.0,"July 19, 1997","We Are! (p. 1, 49-51), Episode 4 (p. 6-47), Ep..."
1,2,1,"That Guy, ""Straw Hat Luffy""","Sono Otoko ""Mugiwara no Rufi""","They Call Him ""Straw Hat Luffy""",23.0,"July 28, 1997","Episode 1 (p. 4-23), Episode of Luffy (p. 4, 8..."
2,3,1,Introducing Pirate Hunter Zoro,"""Kaizoku-gari no Zoro"" Tojo",Enter Zolo: Pirate Hunter,21.0,"August 4, 1997","Episode 2 (p. 1, 3-21)"
3,4,1,"Marine Captain ""Axe-Hand Morgan""","Kaigun Taisa ""Onote no Mogan""",The Great Captain Morgan,19.0,"August 11, 1997",Episode 2 (p. 1-19)
4,5,1,Pirate King and Master Swordsman,Kaizoku-O to Daikengo,The King of the Pirates and the Master Swordsman,19.0,"August 25, 1997","Episode 2 (p. 2-8, 16-19), Episode 19 (p. 9-15..."

In [9]:
data2.head()

,name,chapter,episode,year,note
0,A O,551.0,460.0,2009,His name was revealed by the Marines in Episod...
1,Abdullah,704.0,632.0,2013,NaN
2,Absalom,444.0,339.0,2007,NaN
3,Acilia,706.0,652.0,2013,NaN
4,Adele,608.0,527.0,2010,Her name was revealed in the Blue Deep data book.

In [10]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 978 entries, 0 to 977
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Chapter_Number   978 non-null    int64
 1   Volume           978 non-null    int64
 2   Name             978 non-null    object
 3   Romanized_title  978 non-null    object
 4   Viz_title        978 non-null    object
 5   Pages            977 non-null    float64
 6   Date             978 non-null    object
 7   Episodes         978 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 61.2+ KB

In [11]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1229 entries, 0 to 1228
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     1229 non-null   object
 1   chapter  1213 non-null   float64
 2   episode  1148 non-null   float64
 3   year     1229 non-null   int64
 4   note     811 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 48.1+ KB

In [12]:
#this shows that we have years starting form year '3' which isnt logically correct. There is discrepancy in the data.
data2['year'].sort_values(ascending=True)

1219       3
1221       4
1220       4
1187       5
1206       9
        ...
47      2020
713     2020
699     2020
126     2021
450     2021
Name: year, Length: 1229, dtype: int64